# Machine Learning (ML) Basic
## Dataset
A data is an essential component of ML model and, a dataset definition in ML is “a collection of data that is treated as a single unit by a computer”. This means that a dataset contains a lot of separate pieces of data, but can be used to teach the machine learning algorithm to find predictable patterns inside the whole dataset.

**Splitting the Data: Training, Testing, and Validation Datasets in ML** - Usually, a dataset is used not only for training purposes. A single training set that has already been processed is usually split into several types of datasets in machine learning, which is needed to check how well the training of the model went. For this purpose, a testing dataset is typically separated from the data. Next, a validation dataset, while not strictly crucial, is quite helpful to avoid training your algorithm on the same type of data and making biased predictions.

## Simple data

In [1]:
import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)

data = [[30, 100], [20, 50], [35, 72],
        [25, 80], [30, 70], [40, 60]]
display(data)

[[30, 100], [20, 50], [35, 72], [25, 80], [30, 70], [40, 60]]

## Load dataset
One of the most well-known repositories for machine learning datasets is the [UCI Machien Learning Repository](https://archive.ics.uci.edu/). Most of the datasets over there are small in size because the technology at the time was not advanced enough to handle larger size data. Newer datasets are usually larger in size. For example, the ImageNet dataset is over 160 GB. These datasets are commonly found in [Kaggle](https://www.kaggle.com/datasets), and we can search them by name and download. [OpenML](https://www.openml.org/) is also, a repository that hosts a lot of datasets. It is convenient because you can search for the dataset by name, but it also has a standardized web API for users to retrieve data.

The repositories described above are a good place to start getting datasets, but you may also obtain datasets simply by downloading them from the web using a browser, the command line, a network library such as the wget tool, or a request in Python. *Scikit-learn* is an example where you can download the dataset using its API. Because some of these datasets have become standards or benchmarks, many machine learning libraries have created functions to help you retrieve them. For practical reasons, the datasets often don't come with the library and are downloaded in real time when you call the function, so you'll need a stable internet connection to use them. The related functions are defined under [`sklearn.datasets`](https://scikit-learn.org/stable/api/sklearn.datasets.html), and you may see the list of functions at:

In [2]:
import sklearn.datasets

# load california housing dataset (regression)
data = sklearn.datasets.fetch_california_housing(return_X_y=False, as_frame=True)
data = data["frame"]
print(data)

       MedInc  HouseAge  AveRooms  AveBedrms  Population  AveOccup  Latitude  \
0      8.3252      41.0  6.984127   1.023810       322.0  2.555556     37.88
1      8.3014      21.0  6.238137   0.971880      2401.0  2.109842     37.86
2      7.2574      52.0  8.288136   1.073446       496.0  2.802260     37.85
3      5.6431      52.0  5.817352   1.073059       558.0  2.547945     37.85
4      3.8462      52.0  6.281853   1.081081       565.0  2.181467     37.85
...       ...       ...       ...        ...         ...       ...       ...
20635  1.5603      25.0  5.045455   1.133333       845.0  2.560606     39.48
20636  2.5568      18.0  6.114035   1.315789       356.0  3.122807     39.49
20637  1.7000      17.0  5.205543   1.120092      1007.0  2.325635     39.43
20638  1.8672      18.0  5.329513   1.171920       741.0  2.123209     39.43
20639  2.3886      16.0  5.254717   1.162264      1387.0  2.616981     39.37

       Longitude  MedHouseVal
0        -122.23        4.526
1        -122.22        3.585
2        -122.24        3.521
3        -122.25        3.413
4        -122.25        3.422
...          ...          ...
20635    -121.09        0.781
20636    -121.21        0.771
20637    -121.22        0.923
20638    -121.32        0.847
20639    -121.24        0.894

[20640 rows x 9 columns]

One good thing tat scikit-learn provides is the convenient ability to read any dataset from OpenML. Read dataset and run the logistic regression:

In [3]:
from sklearn.linear_model import LogisticRegression
from sklearn.datasets import fetch_openml

#data = fetch_openml("diabetes", version=1, as_frame=True, return_X_y=False)
data = fetch_openml("titanic", version=6, as_frame=True, return_X_y=False)
print(data["frame"])

x, y = fetch_openml("titanic", version=6, as_frame=False, return_X_y=True)
clf = LogisticRegression(random_state=0).fit(x, y)
print("Accuracy: {:,}".format(clf.score(x, y)))   # accuracy
print("Coefficient:", clf.coef_)                  # coefficient in logistic regression

     Survived  Pclass  Sex  Age  Fare  Embarked  relatives  Title
0           0       3    0    2     0         0          1      1
1           1       1    1    5     3         1          1      3
2           1       3    1    3     0         0          0      2
3           1       1    1    5     3         0          1      3
4           0       3    0    5     1         0          0      1
..        ...     ...  ...  ...   ...       ...        ...    ...
886         0       2    0    3     1         0          0      5
887         1       1    1    2     2         0          0      2
888         0       3    1    1     2         0          3      2
889         1       1    0    3     2         1          0      1
890         0       3    0    4     0         2          0      1

[891 rows x 8 columns]
Accuracy: 0.8114478114478114
Coefficient: [[-0.75486619  2.23758245 -0.20788379  0.2806995   0.24340651 -0.36705508
   0.47881365]]

## Data types: Structured, Semi-structured, Unstructured
### Structured data
Structured data has clearly defined data types (e.g. “name” would be a string and “price” would be a float). Usually, structured data can be indexed. Roughly, if it is tabular, it is structured. 
- Common forms of structured data:
  - Spreadsheets
  - Tables in a SQL database
  - Vectors, matrices and n-dimensional arrays
- Common examples:
  - Daily stock market information
  - An inventory of a particular business
  - Daily marketing performance metrics
### Semi-structured Data
[Semi-structured data](https://en.wikipedia.org/wiki/Semi-structured_data) is a form of structured data that does not obey the tabular structure of data models associated with relational databases or other forms of data tables, but nonetheless contains tags or other markers to separate semantic elements and enforce hierarchies of records and fields within the data. Therefore, it is also known as self-describing structure. Semi-structured data are increasingly occurring since the advent of the Internet where full-text documents and databases are not the only forms of data anymore, and different applications need a medium for exchanging information. In object-oriented databases, one often finds semi-structured data.
- Common forms of semi-structured data:
  - XML (eXtensible Markup Language) and other markup languages files
  - JSON (JavaScript Object Notation) and other data interchange format files

In [4]:
import pandas as pd

customers = pd.DataFrame(
    data={
        'customer_id': ['1', '2', '3', '4'],
        'customerName': ['Gryffindor', 'Hufflepuff', 'Ravenclaw', 'Slytherin']
    }
)

orders = pd.DataFrame(
    data={
        'order_id': ['100', '101', '102', '103', '104'],
        'customer_id': ['1', '1', '3', '4', '4'],
        'product': [
            'Firebolt',
            'Pewter Cauldron',
            'Dragon Hide Gloves',
            'Polyjuice Potion',
            'Weasley Is Our King Buttons',
        ],
        'quantity': [1, 18, 10, 6, 120]
    }
)

display(orders)
print(orders.info(), '\n')

# left join
customer_orders = customers.merge(orders, on='customer_id', how='left')

display(customer_orders)
print(customer_orders.info())

  order_id customer_id                      product  quantity
0      100           1                     Firebolt         1
1      101           1              Pewter Cauldron        18
2      102           3           Dragon Hide Gloves        10
3      103           4             Polyjuice Potion         6
4      104           4  Weasley Is Our King Buttons       120

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   order_id     5 non-null      object
 1   customer_id  5 non-null      object
 2   product      5 non-null      object
 3   quantity     5 non-null      int64
dtypes: int64(1), object(3)
memory usage: 292.0+ bytes
None

  customer_id customerName order_id                      product  quantity
0           1   Gryffindor      100                     Firebolt       1.0
1           1   Gryffindor      101              Pewter Cauldron      18.0
2           2   Hufflepuff      NaN                          NaN       NaN
3           3    Ravenclaw      102           Dragon Hide Gloves      10.0
4           4    Slytherin      103             Polyjuice Potion       6.0
5           4    Slytherin      104  Weasley Is Our King Buttons     120.0

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   customer_id   6 non-null      object
 1   customerName  6 non-null      object
 2   order_id      5 non-null      object
 3   product       5 non-null      object
 4   quantity      5 non-null      float64
dtypes: float64(1), object(4)
memory usage: 372.0+ bytes
None

### Unstructured Data
Unstructured data is pretty much everything that is not structured data, and it is also the most common data throughout the world. For example, it can't be structured due to having varying string lengths and different potential responders from different speakers.
- Common examples of unstructured data:
  - Text files, emails, social media comments, website contents, chats or pretty much anything that is freeform text.
  - Voice messages, phone calls, audio files.

## Missing Data Processing
The difference between data found in many tutorials and data in the real world is that real-world data is rarely clean and homogeneous. In particular, many interesting datasets will have some amount of data missing. To make matters even more complicated, different data sources may indicate missing data in different ways. Therefore, we need to discuss some general considerations for missing data, discuss how Pandas chooses to represent it. For simple solutions, we will use some built-in Pandas tools for handling missing data in Python and we will refer to missing data in general as `null`, `NaN`, or `NA` values.

### Trade-offs in Missing Data Conventions
There are a number of schemes that have been developed to indicate the presence of missing data in a table or DataFrame. Generally, they revolve around one of two strategies: using a *mask* that globally indicates missing values, or choosing a *sentinel value* that indicates a missing entry. None of these approaches is without trade-offs. Common special values like `NaN` are not available for all data types. As in most cases where no universally optimal choice exists, different languages and systems use different conventions.

- In the masking approach, the mask might be an entirely separate Boolean array, or it may involve appropriation of one bit in the data representation to locally indicate the null status of a value. But it requires allocation of an additional Boolean array, which adds overhead in both storage and computation.
- In the sentinel approach, the sentinel value could be some data-specific convention, such as indicating a missing integer value with -9999 or some rare bit pattern, or it could be a more global convention, such as indicating a missing floating-point value with NaN (Not a Number), a special value which is part of the IEEE floating-point specification. However, a sentinel value reduces the range of valid values that can be represented, and may require extra (often non-optimized) logic in CPU and GPU arithmetic.

### Missing Data in Pandas
The way in which Pandas handles missing values is constrained by its reliance on the NumPy package, which does not have a built-in notion of NA values for non-floating-point data types.

Pandas could have followed R's lead in specifying bit patterns for each individual data type to indicate nullness, but this approach turns out to be rather unwieldy.
While R contains four basic data types, NumPy supports *far* more than this: for example, while R has a single integer type, NumPy supports *fourteen* basic integer types once you account for available precisions, signedness, and endianness of the encoding.
Reserving a specific bit pattern in all available NumPy types would lead to an unwieldy amount of overhead in special-casing various operations for various types, likely even requiring a new fork of the NumPy package. Further, for the smaller data types (such as 8-bit integers), sacrificing a bit to use as a mask will significantly reduce the range of values it can represent.

NumPy does have support for masked arrays – that is, arrays that have a separate Boolean mask array attached for marking data as "good" or "bad."
Pandas could have derived from this, but the overhead in both storage, computation, and code maintenance makes that an unattractive choice.

With these constraints in mind, Pandas chose to use sentinels for missing data, and further chose to use two already-existing Python null values: the special floating-point `NaN` value, and the Python `None` object.
This choice has some side effects, as we will see, but in practice ends up being a good compromise in most cases of interest.

#### Pythonic missing data
The first sentinel value used by Pandas is `None`, a Python singleton object that is often used for missing data in Python code.
Because it is a Python object, `None` cannot be used in any arbitrary NumPy/Pandas array, but only in arrays with data type `'object'` (i.e., arrays of Python objects). This ``dtype=object`` means that the best common type representation NumPy could infer for the contents of the array is that they are Python objects. While this kind of object array is useful for some purposes, any operations on the data will be done at the Python level, with much more overhead than the typically fast operations seen for arrays with native types.

In [5]:
import numpy as np # linear algebra
import pandas as pd # data processing

vals1 = np.array([1, None, 3, 4])
vals1

array([1, None, 3, 4], dtype=object)

In [6]:
# comparing computation times by data type
for dtype in ['object', 'int']:
    print("dtype =", dtype)
    %timeit np.arange(1E6, dtype=dtype).sum()
    print()

dtype = object
81.5 ms ± 2.92 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

dtype = int
1.8 ms ± 30 μs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

The use of Python objects in an array also means that if you perform aggregations like ``sum()`` or ``min()`` across an array with a ``None`` value, you will generally get an error. This reflects the fact that addition between an integer and None is undefined.

In [7]:
vals1.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

#### Missing numerical data
The other missing data representation, `NaN` (acronym for *Not a Number*), is different; it is a special floating-point value recognized by all systems that use the standard IEEE floating-point representation. Notice that NumPy chose a native floating-point type for this array: this means that unlike the object array from before, this array supports fast operations pushed into compiled code.
You should be aware that `NaN` is a bit like a data virus–it infects any other object it touches. Regardless of the operation, the result of arithmetic with `NaN` will be another `NaN`:

In [8]:
vals2 = np.array([1, np.nan, 3, 4]) 
print(vals2.dtype)

print("(1 + np.nan): ", 1 + np.nan)
print("(0 *  np.nan):", 0 *  np.nan)

# Note that this means that aggregates over the values are well defined (i.e., they don't result in an error) but not always useful.
print("(Sum, Min, Max of vals2):", vals2.sum(), vals2.min(), vals2.max())

float64
(1 + np.nan):  nan
(0 *  np.nan): nan
(Sum, Min, Max of vals2): nan nan nan

In [9]:
# NumPy does provide some special aggregations that will ignore these missing values:
print("(Sum, Min, Max of vals2 ignoring NaN value):", np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2))

(Sum, Min, Max of vals2 ignoring NaN value): 8.0 1.0 4.0

Keep in mind that ``NaN`` is specifically a floating-point value; there is no equivalent NaN value for integers, strings, or other types.

#### *NaN* and *None* in Pandas
`NaN` and `None` both have their place, and Pandas is built to handle the two of them nearly interchangeably, converting between them where appropriate. For types that don't have an available sentinel value, Pandas automatically type-casts when *NA* values are present. 

For example, if we set a value in an integer array to `np.nan`, it will automatically be upcast to a floating-point type to accommodate the *NA*. In addition to casting the integer array to floating point, Pandas automatically converts the `None` to a `NaN` value. (Be aware that there is a proposal to add a native integer NA to Pandas in the future; as of this writing, it has not been included).

In [10]:
# automatic converting values from 'np.nan' to 'None'
x = pd.Series([1, np.nan, 2, None])
print(x)
print("--------")

# create a new integer dataset, and automatic upcasting during 
x = pd.Series(range(2), dtype=int)
print(x)
print("--------")

x[0] = None
print(x)

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64
--------
0    0
1    1
dtype: int64
--------
0    NaN
1    1.0
dtype: float64

While this type of magic may feel a bit hackish compared to the more unified approach to NA values in domain-specific languages like R, the Pandas sentinel/casting approach works quite well in practice and in my experience only rarely causes issues.

The following table lists the upcasting conventions in Pandas when NA values are introduced:
|Typeclass     | Conversion When Storing NAs | NA Sentinel Value      |
|--------------|-----------------------------|------------------------|
| ``floating`` | No change                   | ``np.nan``             |
| ``object``   | No change                   | ``None`` or ``np.nan`` |
| ``integer``  | Cast to ``float64``         | ``np.nan``             |
| ``boolean``  | Cast to ``object``          | ``None`` or ``np.nan`` |

Keep in mind that in Pandas, string data is always stored with an ``object`` dtype.

#### Operating on *Null* Values
As we have seen, Pandas treats `None` and `NaN` as essentially interchangeable for indicating missing or null values. To facilitate this convention, there are several useful methods for detecting, removing, and replacing null values in Pandas data structures. They are:

- `isnull()`: Generate a boolean mask indicating missing values
- `notnull()`: Opposite of `isnull()`
- `dropna()`: Return a filtered version of the data
- `fillna()`: Return a copy of the data with missing values filled or imputed

We will conclude this section with a brief exploration and demonstration of these routines.

##### *Detecting null values*
Pandas data structures have two useful methods for detecting null data: `isnull()` and `notnull()`. And boolean masks can be used directly as a ``Series`` or ``DataFrame`` index. The `isnull()` and `notnull()` methods produce similar Boolean results for `DataFrame`s. Either one will return a Boolean mask over the data.

In [11]:
data = pd.Series([1, np.nan, 'hello', None])

print(data.isnull())
print("--------")
print(data[data.notnull()])

0    False
1     True
2    False
3     True
dtype: bool
--------
0        1
2    hello
dtype: object

##### *Dropping null values*
In addition to the masking used before, there are the convenience methods, `dropna()` (which removes NA values) and `fillna()` (which fills in NA values). For a `Series`, the result is straightforward:

In [12]:
# drop NA values
print(data.dropna())

0        1
2    hello
dtype: object

For a `DataFrame`, there are more options. We cannot drop single values from a `DataFrame`; we can only drop full rows or full columns. Depending on the application, you might want one or the other, so `dropna()` gives a number of options for a `DataFrame`.

By default, ``dropna()`` will drop all rows in which *any* null value is present. Consider the following `DataFrame`:

In [13]:
# define a new DataFrame has NaN values
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])

display(df)

# drop NA values from a DataFrame
print("Drop NA values from a DataFrame:")
df.dropna()

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

Drop NA values from a DataFrame:

     0    1  2
1  2.0  3.0  5

Alternatively, you can drop NA values along a different axis; ``axis=1`` drops all columns containing a null value.

In [14]:
df.dropna(axis='columns')

   2
0  2
1  5
2  6

But this drops some good data as well; you might rather be interested in dropping rows or columns with *all* NA values, or a majority of NA values. This can be specified through the `how` or `thresh` parameters, which allow fine control of the number of nulls to allow through. The default is `how='any'`, such that any row or column (depending on the `axis` keyword) containing a null value will be dropped.
You can also specify `how='all'`, which will only drop rows/columns that are *all* null values:

In [15]:
df[3] = np.nan
display(df)

print("Drop all NA values from DataFrame based on column:")
df.dropna(axis='columns', how='all')

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

Drop all NA values from DataFrame based on column:

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

For finer-grained control, the ``thresh`` parameter lets you specify a minimum number of non-null values for the row/column to be kept. Here the first and last row have been dropped, because they contain only two non-null values.

In [16]:
df.dropna(axis='rows', thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

##### *Filling null values*
Sometimes rather than dropping NA values, you'd rather replace them with a valid value. This value might be a single number like zero, or it might be some sort of imputation or interpolation from the good values. You could do this in-place using the `isnull()` method as a mask, but because it is such a common operation Pandas provides the `fillna()` method, which returns a copy of the array with the null values replaced. Consider the following `Series`:

In [17]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
display(data)

# fill NA entries with a single value, such as zero
print("Replace NA values with 0:")
display(data.fillna(0))

# specify a forward-fill to propagate the previous value forward
print("Replace NA values with the previous value:")
display(data.ffill())

# Or specify a back-fill to propagate the next values backward
print("Replace NA values with the next value:")
display(data.bfill())

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

Replace NA values with 0:

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

Replace NA values with the previous value:

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

Replace NA values with the next value:

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

For ``DataFrame``s, the options are similar, but we can also specify an ``axis`` along which the fills take place. Notice that if a previous value is not available during a forward fill, the NA value remains.

In [18]:
display(df)

df.ffill(axis=1)

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

# References
- [Kaggle](https://www.kaggle.com/datasets)
- [OpenML](https://www.openml.org/)
- [UCI Machien Learning Repository](https://archive.ics.uci.edu/)
- [10 minutes to pandas](https://pandas.pydata.org/docs/user_guide/10min.html)
- [Python Data Science Handbook](https://github.com/jakevdp/PythonDataScienceHandbook/)